client_data = {
    "имя": "тест",
    "тип": 1,
    "заметки": "тестовые заметки",
    "контакты": {
        "номер": "87897659076",
        "почта": "test_mail.yandex.ru"
    }
}

user_data = {
    "фамилия": "Иванов",
    "имя": "Иван",
    "пароль": "securepassword",
    "отчество": "Иванович",
    "название_организации": "ООО Ромашка",
    "почта": "ivan@example.com",
    "номер": "79991234567",
    "роль": 1,
}

user_login_email = {
    "почта": "ivan@example.com", 
    "пароль": "securepassword"
}

user_login_number = {
    "номер": "79991234567", 
    "пароль": "securepassword"
}

equipment_data = {
    "модель": "Sdt",
    "серия": "345wd",
    "статус": 1,
    "расположение": 1
}

location_data = {
    "название": "тексел", 
    "адрес": "пушкинская д 6" ,
    "часы_работы": {
        "пн-пт": "09:00-18:00",
        "сб": "10:00-15:00",
        "вс": "выходной",
    }
}

operator_data = {
    "пользователь": 1,
    "локации": [
        "пушкинская д 56",
        "пушкинская д 6"
    ],
    "график": {
        "пн-пт": "9:00-18:00",
        "вс": "10:00-16:00"
    }
}

role_data_admin = {
    "название_роли": "admin",
    "описание": "Администратор системы"
}

role_data_user = {
    "название_роли": "user", 
    "описание": "Обычный юзер"
}

role_data = {
    "название_роли": "manager", 
    "описание": "Менеджер"
    }

service_data = {
    "услуга": "сканирование помещения"
}

service_data = {
    "услуга": "сканирование помещения"
}

se_data = {"статус": "активно"}

type_client_data = {"тип": "ИП"}
